[Killed] ArrayDeclaration
src/lib/tlx.ts:3:47
 import type { SubscaleCode, SubscaleMeta, SubscalePair } from '#/types/domain'
 
-export const SUBSCALE_CODES: SubscaleCode[] = [
-  'MD',
-  'PD',
-  'TD',
-  'OP',
-  'EF',
-  'FR',
-]
+export const SUBSCALE_CODES: SubscaleCode[] = []
 
 // All C(6,2) = 15 pairs in canonical order
killedBy: computeWeights weight sum equals 15
statusReason: expected +0 to be 15 // Object.is equality

[Killed] StringLiteral
src/lib/tlx.ts:4:3
 import type { SubscaleCode, SubscaleMeta, SubscalePair } from '#/types/domain'
 
 export const SUBSCALE_CODES: SubscaleCode[] = [
-  'MD',
+  "",
   'PD',
   'TD',
killedBy: computeWeights weight sum equals 15
statusReason: expected NaN to be 15 // Object.is equality

[Killed] StringLiteral
src/lib/tlx.ts:6:3
 export const SUBSCALE_CODES: SubscaleCode[] = [
   'MD',
   'PD',
-  'TD',
+  "",
   'OP',
   'EF',
killedBy: computeWeights weight sum equals 15
statusReason: expected NaN to be 15 // Object.is equality

[Killed] StringLiteral
src/lib/tlx.ts:7:3
   'MD',
   'PD',
   'TD',
-  'OP',
+  "",
   'EF',
   'FR',
killedBy: computeWeights weight sum equals 15
statusReason: expected NaN to be 15 // Object.is equality

[Killed] StringLiteral
src/lib/tlx.ts:9:3
   'TD',
   'OP',
   'EF',
-  'FR',
+  "",
 ]
 
killedBy: computeWeights weight sum equals 15
statusReason: expected NaN to be 15 // Object.is equality

[Killed] ArrayDeclaration
src/lib/tlx.ts:13:48
 ]
 
 // All C(6,2) = 15 pairs in canonical order
-export const CANONICAL_PAIRS: SubscalePair[] = [
-  { a: 'MD', b: 'PD' }, // 0
-  { a: 'MD', b: 'TD' }, // 1
-  { a: 'MD', b: 'OP' }, // 2
-  { a: 'MD', b: 'EF' }, // 3
-  { a: 'MD', b: 'FR' }, // 4
-  { a: 'PD', b: 'TD' }, // 5
-  { a: 'PD', b: 'OP' }, // 6
-  { a: 'PD', b: 'EF' }, // 7
-  { a: 'PD', b: 'FR' }, // 8
-  { a: 'TD', b: 'OP' }, // 9
-  { a: 'TD', b: 'EF' }, // 10
-  { a: 'TD', b: 'FR' }, // 11
-  { a: 'OP', b: 'EF' }, // 12
-  { a: 'OP', b: 'FR' }, // 13
-  { a: 'EF', b: 'FR' }, // 14
-]
+export const CANONICAL_PAIRS: SubscalePair[] = []
 
 export const SUBSCALE_META: Record<SubscaleCode, SubscaleMeta> = {
killedBy: CANONICAL_PAIRS has exactly 15 pairs
statusReason: expected [] to have a length of 15 but got +0

[Killed] ObjectLiteral
src/lib/tlx.ts:14:3
 
 // All C(6,2) = 15 pairs in canonical order
 export const CANONICAL_PAIRS: SubscalePair[] = [
-  { a: 'MD', b: 'PD' }, // 0
+  {}, // 0
   { a: 'MD', b: 'TD' }, // 1
   { a: 'MD', b: 'OP' }, // 2
killedBy: CANONICAL_PAIRS covers all C(6,2) combinations
statusReason: expected 4 to be 5 // Object.is equality

[Killed] StringLiteral
src/lib/tlx.ts:14:8
 
 // All C(6,2) = 15 pairs in canonical order
 export const CANONICAL_PAIRS: SubscalePair[] = [
-  { a: 'MD', b: 'PD' }, // 0
+  { a: "", b: 'PD' }, // 0
   { a: 'MD', b: 'TD' }, // 1
   { a: 'MD', b: 'OP' }, // 2
killedBy: CANONICAL_PAIRS covers all C(6,2) combinations
statusReason: expected 4 to be 5 // Object.is equality

[Killed] StringLiteral
src/lib/tlx.ts:15:8
 // All C(6,2) = 15 pairs in canonical order
 export const CANONICAL_PAIRS: SubscalePair[] = [
   { a: 'MD', b: 'PD' }, // 0
-  { a: 'MD', b: 'TD' }, // 1
+  { a: "", b: 'TD' }, // 1
   { a: 'MD', b: 'OP' }, // 2
   { a: 'MD', b: 'EF' }, // 3
killedBy: CANONICAL_PAIRS covers all C(6,2) combinations
statusReason: expected 4 to be 5 // Object.is equality

[Killed] StringLiteral
src/lib/tlx.ts:16:17
 export const CANONICAL_PAIRS: SubscalePair[] = [
   { a: 'MD', b: 'PD' }, // 0
   { a: 'MD', b: 'TD' }, // 1
-  { a: 'MD', b: 'OP' }, // 2
+  { a: 'MD', b: "" }, // 2
   { a: 'MD', b: 'EF' }, // 3
   { a: 'MD', b: 'FR' }, // 4
killedBy: CANONICAL_PAIRS covers all C(6,2) combinations
statusReason: expected 4 to be 5 // Object.is equality

[Killed] ObjectLiteral
src/lib/tlx.ts:17:3
   { a: 'MD', b: 'PD' }, // 0
   { a: 'MD', b: 'TD' }, // 1
   { a: 'MD', b: 'OP' }, // 2
-  { a: 'MD', b: 'EF' }, // 3
+  {}, // 3
   { a: 'MD', b: 'FR' }, // 4
   { a: 'PD', b: 'TD' }, // 5
killedBy: CANONICAL_PAIRS covers all C(6,2) combinations
statusReason: expected 4 to be 5 // Object.is equality

[Killed] StringLiteral
src/lib/tlx.ts:19:17
   { a: 'MD', b: 'OP' }, // 2
   { a: 'MD', b: 'EF' }, // 3
   { a: 'MD', b: 'FR' }, // 4
-  { a: 'PD', b: 'TD' }, // 5
+  { a: 'PD', b: "" }, // 5
   { a: 'PD', b: 'OP' }, // 6
   { a: 'PD', b: 'EF' }, // 7
killedBy: CANONICAL_PAIRS covers all C(6,2) combinations
statusReason: expected 4 to be 5 // Object.is equality

[Killed] ObjectLiteral
src/lib/tlx.ts:19:3
   { a: 'MD', b: 'OP' }, // 2
   { a: 'MD', b: 'EF' }, // 3
   { a: 'MD', b: 'FR' }, // 4
-  { a: 'PD', b: 'TD' }, // 5
+  {}, // 5
   { a: 'PD', b: 'OP' }, // 6
   { a: 'PD', b: 'EF' }, // 7
killedBy: CANONICAL_PAIRS covers all C(6,2) combinations
statusReason: expected 4 to be 5 // Object.is equality

[Killed] StringLiteral
src/lib/tlx.ts:20:8
   { a: 'MD', b: 'EF' }, // 3
   { a: 'MD', b: 'FR' }, // 4
   { a: 'PD', b: 'TD' }, // 5
-  { a: 'PD', b: 'OP' }, // 6
+  { a: "", b: 'OP' }, // 6
   { a: 'PD', b: 'EF' }, // 7
   { a: 'PD', b: 'FR' }, // 8
killedBy: CANONICAL_PAIRS covers all C(6,2) combinations
statusReason: expected 4 to be 5 // Object.is equality

[Killed] StringLiteral
src/lib/tlx.ts:21:8
   { a: 'MD', b: 'FR' }, // 4
   { a: 'PD', b: 'TD' }, // 5
   { a: 'PD', b: 'OP' }, // 6
-  { a: 'PD', b: 'EF' }, // 7
+  { a: "", b: 'EF' }, // 7
   { a: 'PD', b: 'FR' }, // 8
   { a: 'TD', b: 'OP' }, // 9
killedBy: CANONICAL_PAIRS covers all C(6,2) combinations
statusReason: expected 4 to be 5 // Object.is equality

[Killed] ObjectLiteral
src/lib/tlx.ts:22:3
   { a: 'PD', b: 'TD' }, // 5
   { a: 'PD', b: 'OP' }, // 6
   { a: 'PD', b: 'EF' }, // 7
-  { a: 'PD', b: 'FR' }, // 8
+  {}, // 8
   { a: 'TD', b: 'OP' }, // 9
   { a: 'TD', b: 'EF' }, // 10
killedBy: CANONICAL_PAIRS covers all C(6,2) combinations
statusReason: expected 4 to be 5 // Object.is equality

[Killed] StringLiteral
src/lib/tlx.ts:22:17
   { a: 'PD', b: 'TD' }, // 5
   { a: 'PD', b: 'OP' }, // 6
   { a: 'PD', b: 'EF' }, // 7
-  { a: 'PD', b: 'FR' }, // 8
+  { a: 'PD', b: "" }, // 8
   { a: 'TD', b: 'OP' }, // 9
   { a: 'TD', b: 'EF' }, // 10
killedBy: CANONICAL_PAIRS covers all C(6,2) combinations
statusReason: expected 4 to be 5 // Object.is equality

[Killed] ObjectLiteral
src/lib/tlx.ts:23:3
   { a: 'PD', b: 'OP' }, // 6
   { a: 'PD', b: 'EF' }, // 7
   { a: 'PD', b: 'FR' }, // 8
-  { a: 'TD', b: 'OP' }, // 9
+  {}, // 9
   { a: 'TD', b: 'EF' }, // 10
   { a: 'TD', b: 'FR' }, // 11
killedBy: CANONICAL_PAIRS covers all C(6,2) combinations
statusReason: expected 4 to be 5 // Object.is equality

[Killed] StringLiteral
src/lib/tlx.ts:23:17
   { a: 'PD', b: 'OP' }, // 6
   { a: 'PD', b: 'EF' }, // 7
   { a: 'PD', b: 'FR' }, // 8
-  { a: 'TD', b: 'OP' }, // 9
+  { a: 'TD', b: "" }, // 9
   { a: 'TD', b: 'EF' }, // 10
   { a: 'TD', b: 'FR' }, // 11
killedBy: CANONICAL_PAIRS covers all C(6,2) combinations
statusReason: expected 4 to be 5 // Object.is equality

[Killed] StringLiteral
src/lib/tlx.ts:24:8
   { a: 'PD', b: 'EF' }, // 7
   { a: 'PD', b: 'FR' }, // 8
   { a: 'TD', b: 'OP' }, // 9
-  { a: 'TD', b: 'EF' }, // 10
+  { a: "", b: 'EF' }, // 10
   { a: 'TD', b: 'FR' }, // 11
   { a: 'OP', b: 'EF' }, // 12
killedBy: CANONICAL_PAIRS covers all C(6,2) combinations
statusReason: expected 4 to be 5 // Object.is equality

[Killed] StringLiteral
src/lib/tlx.ts:26:8
   { a: 'TD', b: 'OP' }, // 9
   { a: 'TD', b: 'EF' }, // 10
   { a: 'TD', b: 'FR' }, // 11
-  { a: 'OP', b: 'EF' }, // 12
+  { a: "", b: 'EF' }, // 12
   { a: 'OP', b: 'FR' }, // 13
   { a: 'EF', b: 'FR' }, // 14
killedBy: CANONICAL_PAIRS covers all C(6,2) combinations
statusReason: expected 4 to be 5 // Object.is equality

[Killed] StringLiteral
src/lib/tlx.ts:27:8
   { a: 'TD', b: 'EF' }, // 10
   { a: 'TD', b: 'FR' }, // 11
   { a: 'OP', b: 'EF' }, // 12
-  { a: 'OP', b: 'FR' }, // 13
+  { a: "", b: 'FR' }, // 13
   { a: 'EF', b: 'FR' }, // 14
 ]
killedBy: CANONICAL_PAIRS covers all C(6,2) combinations
statusReason: expected 4 to be 5 // Object.is equality

[Killed] ObjectLiteral
src/lib/tlx.ts:32:7
 ]
 
 export const SUBSCALE_META: Record<SubscaleCode, SubscaleMeta> = {
-  MD: {
-    code: 'MD',
-    nameKey: 'subscale.MD.name',
-    descriptionKey: 'subscale.MD.description',
-    leftEndpointKey: 'subscale.MD.left',
-    rightEndpointKey: 'subscale.MD.right',
-  },
+  MD: {},
   PD: {
     code: 'PD',
killedBy: SUBSCALE_META each entry has a code field matching its key
statusReason: expected undefined to be 'MD' // Object.is equality

[Killed] StringLiteral
src/lib/tlx.ts:37:23
     nameKey: 'subscale.MD.name',
     descriptionKey: 'subscale.MD.description',
     leftEndpointKey: 'subscale.MD.left',
-    rightEndpointKey: 'subscale.MD.right',
+    rightEndpointKey: "",
   },
   PD: {
killedBy: SUBSCALE_META MD has correct i18n keys
statusReason: expected '' to be 'subscale.MD.right' // Object.is equality

[Killed] ObjectLiteral
src/lib/tlx.ts:39:7
     leftEndpointKey: 'subscale.MD.left',
     rightEndpointKey: 'subscale.MD.right',
   },
-  PD: {
-    code: 'PD',
-    nameKey: 'subscale.PD.name',
-    descriptionKey: 'subscale.PD.description',
-    leftEndpointKey: 'subscale.PD.left',
-    rightEndpointKey: 'subscale.PD.right',
-  },
+  PD: {},
   TD: {
     code: 'TD',
killedBy: SUBSCALE_META each entry has a code field matching its key
statusReason: expected undefined to be 'PD' // Object.is equality

[Killed] StringLiteral
src/lib/tlx.ts:41:14
   },
   PD: {
     code: 'PD',
-    nameKey: 'subscale.PD.name',
+    nameKey: "",
     descriptionKey: 'subscale.PD.description',
     leftEndpointKey: 'subscale.PD.left',
killedBy: SUBSCALE_META PD has correct i18n keys
statusReason: expected '' to be 'subscale.PD.name' // Object.is equality

[Killed] StringLiteral
src/lib/tlx.ts:48:14
   },
   TD: {
     code: 'TD',
-    nameKey: 'subscale.TD.name',
+    nameKey: "",
     descriptionKey: 'subscale.TD.description',
     leftEndpointKey: 'subscale.TD.left',
killedBy: SUBSCALE_META TD has correct i18n keys
statusReason: expected '' to be 'subscale.TD.name' // Object.is equality

[Killed] StringLiteral
src/lib/tlx.ts:51:23
     nameKey: 'subscale.TD.name',
     descriptionKey: 'subscale.TD.description',
     leftEndpointKey: 'subscale.TD.left',
-    rightEndpointKey: 'subscale.TD.right',
+    rightEndpointKey: "",
   },
   OP: {
killedBy: SUBSCALE_META TD has correct i18n keys
statusReason: expected '' to be 'subscale.TD.right' // Object.is equality

[Killed] StringLiteral
src/lib/tlx.ts:55:14
   },
   OP: {
     code: 'OP',
-    nameKey: 'subscale.OP.name',
+    nameKey: "",
     descriptionKey: 'subscale.OP.description',
     leftEndpointKey: 'subscale.OP.left', // "Good" = low workload
killedBy: SUBSCALE_META OP has correct i18n keys (reversed semantics: left=Good, right=Poor)
statusReason: expected '' to be 'subscale.OP.name' // Object.is equality

[Killed] StringLiteral
src/lib/tlx.ts:61:11
     rightEndpointKey: 'subscale.OP.right', // "Poor" = high workload
   },
   EF: {
-    code: 'EF',
+    code: "",
     nameKey: 'subscale.EF.name',
     descriptionKey: 'subscale.EF.description',
killedBy: SUBSCALE_META each entry has a code field matching its key
statusReason: expected '' to be 'EF' // Object.is equality

[Killed] StringLiteral
src/lib/tlx.ts:65:23
     nameKey: 'subscale.EF.name',
     descriptionKey: 'subscale.EF.description',
     leftEndpointKey: 'subscale.EF.left',
-    rightEndpointKey: 'subscale.EF.right',
+    rightEndpointKey: "",
   },
   FR: {
killedBy: SUBSCALE_META EF has correct i18n keys
statusReason: expected '' to be 'subscale.EF.right' // Object.is equality

[Killed] StringLiteral
src/lib/tlx.ts:71:22
     code: 'FR',
     nameKey: 'subscale.FR.name',
     descriptionKey: 'subscale.FR.description',
-    leftEndpointKey: 'subscale.FR.left',
+    leftEndpointKey: "",
     rightEndpointKey: 'subscale.FR.right',
   },
killedBy: SUBSCALE_META FR has correct i18n keys
statusReason: expected '' to be 'subscale.FR.left' // Object.is equality

[Killed] StringLiteral
src/lib/tlx.ts:72:23
     nameKey: 'subscale.FR.name',
     descriptionKey: 'subscale.FR.description',
     leftEndpointKey: 'subscale.FR.left',
-    rightEndpointKey: 'subscale.FR.right',
+    rightEndpointKey: "",
   },
 }
killedBy: SUBSCALE_META FR has correct i18n keys
statusReason: expected '' to be 'subscale.FR.right' // Object.is equality

[Killed] BlockStatement
src/lib/tlx.ts:77:48
 }
 
 /** Fisher-Yates shuffle — returns a new array */
-export function shuffleArray<T>(arr: T[]): T[] {
-  const result = [...arr]
-  for (let i = result.length - 1; i > 0; i--) {
-    const j = Math.floor(Math.random() * (i + 1))
-    ;[result[i], result[j]] = [result[j], result[i]]
-  }
-  return result
-}
+export function shuffleArray<T>(arr: T[]): T[] {}
 
 /** Snap a slider position (0–100) to nearest 5-point increment */
killedBy: shuffleArray returns a new array with the same elements
statusReason: Target cannot be null or undefined.

[Killed] ConditionalExpression
src/lib/tlx.ts:79:35
 /** Fisher-Yates shuffle — returns a new array */
 export function shuffleArray<T>(arr: T[]): T[] {
   const result = [...arr]
-  for (let i = result.length - 1; i > 0; i--) {
+  for (let i = result.length - 1; false; i--) {
     const j = Math.floor(Math.random() * (i + 1))
     ;[result[i], result[j]] = [result[j], result[i]]
killedBy: shuffleArray actually rearranges elements (kills loop-skipping mutations)
statusReason: expected [ 'A', 'B', 'C' ] to not deeply equal [ 'A', 'B', 'C' ]

[Killed] EqualityOperator
src/lib/tlx.ts:79:35
 /** Fisher-Yates shuffle — returns a new array */
 export function shuffleArray<T>(arr: T[]): T[] {
   const result = [...arr]
-  for (let i = result.length - 1; i > 0; i--) {
+  for (let i = result.length - 1; i <= 0; i--) {
     const j = Math.floor(Math.random() * (i + 1))
     ;[result[i], result[j]] = [result[j], result[i]]
killedBy: shuffleArray actually rearranges elements (kills loop-skipping mutations)
statusReason: expected [ 'A', 'B', 'C' ] to not deeply equal [ 'A', 'B', 'C' ]

[Survived] ArithmeticOperator
src/lib/tlx.ts:80:43
 export function shuffleArray<T>(arr: T[]): T[] {
   const result = [...arr]
   for (let i = result.length - 1; i > 0; i--) {
-    const j = Math.floor(Math.random() * (i + 1))
+    const j = Math.floor(Math.random() * (i - 1))
     ;[result[i], result[j]] = [result[j], result[i]]
   }

[Survived] ArithmeticOperator
src/lib/tlx.ts:80:26
 export function shuffleArray<T>(arr: T[]): T[] {
   const result = [...arr]
   for (let i = result.length - 1; i > 0; i--) {
-    const j = Math.floor(Math.random() * (i + 1))
+    const j = Math.floor(Math.random() / (i + 1))
     ;[result[i], result[j]] = [result[j], result[i]]
   }

[Killed] BlockStatement
src/lib/tlx.ts:87:59
 }
 
 /** Snap a slider position (0–100) to nearest 5-point increment */
-export function snapSliderValue(position: number): number {
-  return Math.round(position / 5) * 5
-}
+export function snapSliderValue(position: number): number {}
 
 /** Compute per-subscale weights from pairwise comparisons.
killedBy: snapSliderValue snaps 0 to 0
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/lib/tlx.ts:88:10
 
 /** Snap a slider position (0–100) to nearest 5-point increment */
 export function snapSliderValue(position: number): number {
-  return Math.round(position / 5) * 5
+  return Math.round(position / 5) / 5
 }
 
killedBy: snapSliderValue snaps 5 to 5
statusReason: expected 0.2 to be 5 // Object.is equality

[Killed] ArithmeticOperator
src/lib/tlx.ts:88:21
 
 /** Snap a slider position (0–100) to nearest 5-point increment */
 export function snapSliderValue(position: number): number {
-  return Math.round(position / 5) * 5
+  return Math.round(position * 5) * 5
 }
 
killedBy: snapSliderValue snaps 5 to 5
statusReason: expected 125 to be 5 // Object.is equality

[Killed] BlockStatement
src/lib/tlx.ts:97:33
  */
 export function computeWeights(
   comparisons: Array<{ selected: SubscaleCode }>,
-): Record<SubscaleCode, number> {
-  const weights: Record<SubscaleCode, number> = {
-    MD: 0,
-    PD: 0,
-    TD: 0,
-    OP: 0,
-    EF: 0,
-    FR: 0,
-  }
-  for (const c of comparisons) {
-    weights[c.selected]++
-  }
-  return weights
-}
+): Record<SubscaleCode, number> {}
 
 /** Weighted TLX: Σ(rating[i] × weight[i]) / 15 */
killedBy: computeWeights counts selections correctly
statusReason: Cannot read properties of undefined (reading 'MD')

[Killed] BlockStatement
src/lib/tlx.ts:106:32
     EF: 0,
     FR: 0,
   }
-  for (const c of comparisons) {
-    weights[c.selected]++
-  }
+  for (const c of comparisons) {}
   return weights
 }
killedBy: computeWeights counts selections correctly
statusReason: expected +0 to be 3 // Object.is equality

[Killed] UpdateOperator
src/lib/tlx.ts:107:5
     FR: 0,
   }
   for (const c of comparisons) {
-    weights[c.selected]++
+    weights[c.selected]--
   }
   return weights
killedBy: computeWeights counts selections correctly
statusReason: expected -3 to be 3 // Object.is equality

[Killed] BlockStatement
src/lib/tlx.ts:116:11
 export function computeWeightedTLX(
   weights: Record<SubscaleCode, number>,
   ratings: Record<SubscaleCode, number>,
-): number {
-  const sum = SUBSCALE_CODES.reduce(
-    (acc, code) => acc + ratings[code] * weights[code],
-    0,
-  )
-  return sum / 15
-}
+): number {}
 
 /** Raw TLX: mean of all 6 subscale ratings */
killedBy: computeWeightedTLX computes weighted TLX correctly
statusReason: expected undefined to be 50 // Object.is equality

[Killed] ArithmeticOperator
src/lib/tlx.ts:118:26
   ratings: Record<SubscaleCode, number>,
 ): number {
   const sum = SUBSCALE_CODES.reduce(
-    (acc, code) => acc + ratings[code] * weights[code],
+    (acc, code) => acc + ratings[code] / weights[code],
     0,
   )
killedBy: computeWeightedTLX computes weighted TLX correctly
statusReason: expected 10.111111111111112 to be 50 // Object.is equality

[Killed] ArrowFunction
src/lib/tlx.ts:118:5
   ratings: Record<SubscaleCode, number>,
 ): number {
   const sum = SUBSCALE_CODES.reduce(
-    (acc, code) => acc + ratings[code] * weights[code],
+    () => undefined,
     0,
   )
killedBy: computeWeightedTLX computes weighted TLX correctly
statusReason: expected NaN to be 50 // Object.is equality

[Killed] ArithmeticOperator
src/lib/tlx.ts:121:10
     (acc, code) => acc + ratings[code] * weights[code],
     0,
   )
-  return sum / 15
+  return sum * 15
 }
 
killedBy: computeWeightedTLX computes weighted TLX correctly
statusReason: expected 11250 to be 50 // Object.is equality

[Killed] BlockStatement
src/lib/tlx.ts:125:78
 }
 
 /** Raw TLX: mean of all 6 subscale ratings */
-export function computeRawTLX(ratings: Record<SubscaleCode, number>): number {
-  const sum = SUBSCALE_CODES.reduce((acc, code) => acc + ratings[code], 0)
-  return sum / 6
-}
+export function computeRawTLX(ratings: Record<SubscaleCode, number>): number {}
 
killedBy: computeRawTLX computes mean of all 6 subscale ratings
statusReason: expected undefined to be close to 46.6667, received difference is NaN, but expected 0.0005

[Killed] ArrowFunction
src/lib/tlx.ts:126:37
 
 /** Raw TLX: mean of all 6 subscale ratings */
 export function computeRawTLX(ratings: Record<SubscaleCode, number>): number {
-  const sum = SUBSCALE_CODES.reduce((acc, code) => acc + ratings[code], 0)
+  const sum = SUBSCALE_CODES.reduce(() => undefined, 0)
   return sum / 6
 }
killedBy: computeRawTLX computes mean of all 6 subscale ratings
statusReason: expected NaN to be close to 46.6667, received difference is NaN, but expected 0.0005

[Killed] ArithmeticOperator
src/lib/tlx.ts:126:52
 
 /** Raw TLX: mean of all 6 subscale ratings */
 export function computeRawTLX(ratings: Record<SubscaleCode, number>): number {
-  const sum = SUBSCALE_CODES.reduce((acc, code) => acc + ratings[code], 0)
+  const sum = SUBSCALE_CODES.reduce((acc, code) => acc - ratings[code], 0)
   return sum / 6
 }
killedBy: computeRawTLX computes mean of all 6 subscale ratings
statusReason: expected -46.666666666666664 to be close to 46.6667, received difference is 93.33336666666666, but expected 0.0005

[Killed] ArithmeticOperator
src/lib/tlx.ts:127:10
 /** Raw TLX: mean of all 6 subscale ratings */
 export function computeRawTLX(ratings: Record<SubscaleCode, number>): number {
   const sum = SUBSCALE_CODES.reduce((acc, code) => acc + ratings[code], 0)
-  return sum / 6
+  return sum * 6
 }
 
killedBy: computeRawTLX computes mean of all 6 subscale ratings
statusReason: expected 1680 to be close to 46.6667, received difference is 1633.3333, but expected 0.0005
